elua/elua_builder/app/templates/stm32_platform_conf.h
// eLua platform configuration

#ifndef __PLATFORM_CONF_H__
#define __PLATFORM_CONF_H__

#include "auxmods.h"
#include "type.h"
#include "stacks.h"
#include "stm32f10x_lib.h"

// *****************************************************************************
// Define here what components you want for this platform

$build_xmodem #define BUILD_XMODEM
$build_shell #define BUILD_SHELL
$build_romfs #define BUILD_ROMFS
$build_term #define BUILD_TERM
$build_uip #define BUILD_UIP
$build_dhcpc #define BUILD_DHCPC
$build_dns #define BUILD_DNS
$build_con_generic #define BUILD_CON_GENERIC
$build_adc #define BUILD_ADC
$build_con_tcp #define BUILD_CON_TCP

// *****************************************************************************
// UART/Timer IDs configuration data (used in main.c)

#define CON_UART_ID           0
#define CON_UART_SPEED        115200
#define CON_TIMER_ID          0
#define TERM_LINES            25
#define TERM_COLS             80

// *****************************************************************************
// Auxiliary libraries that will be compiled for this platform

#ifdef FORSTM3210E_EVAL
#define AUXLIB_LCD      "stm3210lcd"
LUALIB_API int ( luaopen_lcd )( lua_State* L );
#define LCDLINE  _ROM( AUXLIB_LCD, luaopen_lcd, lcd_map )
#else
#define LCDLINE
#endif

#define LUA_PLATFORM_LIBS_ROM\
  _ROM( AUXLIB_PIO, luaopen_pio, pio_map )\
  _ROM( AUXLIB_PD, luaopen_pd, pd_map )\
  _ROM( AUXLIB_UART, luaopen_uart, uart_map )\
  _ROM( AUXLIB_TERM, luaopen_term, term_map )\
  _ROM( AUXLIB_PACK, luaopen_pack, pack_map )\
  _ROM( AUXLIB_BIT, luaopen_bit, bit_map )\
  _ROM( AUXLIB_CPU, luaopen_cpu, cpu_map )\
  _ROM( AUXLIB_TMR, luaopen_tmr, tmr_map )\
  _ROM( AUXLIB_ADC, luaopen_adc, adc_map )\
  LCDLINE\
  _ROM( LUA_MATHLIBNAME, luaopen_math, math_map )

// *****************************************************************************
// Configuration data

// Static TCP/IP configuration
#define ELUA_CONF_IPADDR0     $ip0
#define ELUA_CONF_IPADDR1     $ip1
#define ELUA_CONF_IPADDR2     $ip2
#define ELUA_CONF_IPADDR3     $ip3

#define ELUA_CONF_NETMASK0    $mask0
#define ELUA_CONF_NETMASK1    $mask1
#define ELUA_CONF_NETMASK2    $mask2
#define ELUA_CONF_NETMASK3    $mask3

#define ELUA_CONF_DEFGW0      $gateway0
#define ELUA_CONF_DEFGW1      $gateway1
#define ELUA_CONF_DEFGW2      $gateway2
#define ELUA_CONF_DEFGW3      $gateway3

#define ELUA_CONF_DNS0        $dns0
#define ELUA_CONF_DNS1        $dns1
#define ELUA_CONF_DNS2        $dns2
#define ELUA_CONF_DNS3        $dns3

// *****************************************************************************
// Configuration data

// Virtual timers (0 if not used)
#define VTMR_NUM_TIMERS       0
#define VTMR_FREQ_HZ          4

// Number of resources (0 if not available/not implemented)
#define NUM_PIO               7
#define NUM_SPI               0
#define NUM_UART              5
#define NUM_TIMER             6
#define NUM_PWM               0
#define NUM_ADC               16

// ADC Configuration Params
#define ADC_BIT_RESOLUTION    12
#define BUF_ENABLE_ADC
#define ADC_BUF_SIZE          BUF_SIZE_2

// These should be adjusted to support multiple ADC devices
#define ADC_TIMER_FIRST_ID    0
#define ADC_NUM_TIMERS        4


// CPU frequency (needed by the CPU module, 0 if not used)
u32 platform_s_cpu_get_frequency();
#define CPU_FREQUENCY         platform_s_cpu_get_frequency()

// PIO prefix ('0' for P0, P1, ... or 'A' for PA, PB, ...)
#define PIO_PREFIX            'A'
// Pins per port configuration:
// #define PIO_PINS_PER_PORT (n) if each port has the same number of pins, or
// #define PIO_PIN_ARRAY { n1, n2, ... } to define pins per port in an array
// Use #define PIO_PINS_PER_PORT 0 if this isn't needed
#define PIO_PINS_PER_PORT     16

// Allocator data: define your free memory zones here in two arrays
// (start address and end address)
#define SRAM_SIZE             ( 64 * 1024 )
#define MEM_START_ADDRESS     { ( void* )end }
#define MEM_END_ADDRESS       { ( void* )( SRAM_BASE + SRAM_SIZE - STACK_SIZE_TOTAL - 1 ) }

#endif // #ifndef __PLATFORM_CONF_H__

